Catalogs/ПериодыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ПериодыОбучения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УчебныеГода</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоНедель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПериодыОбучения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		НачалоСеместра = Объект.ДатаНачала;
		КонецСеместра = Объект.ДатаОкончания;
		
		РазницаВДнях = КонецСеместра - НачалоСеместра;
		РазницаВНеделях = Цел(РазницаВДнях / (60 * 60 * 24 * 7));
		Объект.КоличествоНедель = РазницаВНеделях;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		НачалоСеместра = Объект.ДатаНачала;
		КонецСеместра = Объект.ДатаОкончания;
		
		РазницаВДнях = КонецСеместра - НачалоСеместра;
		РазницаВНеделях = Цел(РазницаВДнях / 7);
		Объект.КоличествоНедель = РазницаВНеделях;
	КонецЕсли;
КонецПроцедуры
